#+AUTHOR: guanghui
#+TAGS: { WORK(w) Emacs(e) WRITING(h) LIFE(l) DREAM(d) OTHER(o)  PROJECT(p) MEETING(m)}

* Daily Work

* Daily Tasks
#+category: Daily
** TODO [#B] Learn Algorithm two tomatoes                                :DREAM:
   - State "DONE"       from "STARTED"    [2014-10-05 Sun 09:22]
   - State "DONE"       from "STARTED"    [2014-04-08 Tue 21:43]
   - State "DONE"       from "STARTED"    [2014-04-04 Fri 23:01]
   - State "DONE"       from "STARTED"    [2014-03-30 Sun 22:13]
   - State "DONE"       from "STARTED"    [2014-03-28 Fri 22:50]
   SCHEDULED: <2014-10-06 Mon 17:00-18:00 .+1d>
   :LOGBOOK:
   CLOCK: [2014-10-03 Fri 22:23]--[2014-10-03 Fri 22:48] =>  0:25
   CLOCK: [2014-09-17 Wed 21:51]--[2014-09-17 Wed 22:16] =>  0:25
   CLOCK: [2014-09-16 Tue 21:56]--[2014-09-16 Tue 22:21] =>  0:25
   CLOCK: [2014-09-16 Tue 21:26]--[2014-09-16 Tue 21:51] =>  0:25
   CLOCK: [2014-04-08 Tue 20:52]--[2014-04-08 Tue 21:17] =>  0:25
   CLOCK: [2014-04-01 Tue 22:25]--[2014-04-01 Tue 22:50] =>  0:25
   CLOCK: [2014-03-29 Sat 22:19]--[2014-03-29 Sat 22:32] =>  0:13
   CLOCK: [2014-03-28 Fri 22:14]--[2014-03-28 Fri 22:39] =>  0:25
   CLOCK: [2014-03-28 Fri 21:44]--[2014-03-28 Fri 22:09] =>  0:25
   :END:
** TODO [#B] Visit Cocos2D-x.org, visit forum                         :WORK:
SCHEDULED: <2015-06-18 Thu 09:30-09:50 .+1d>
- State "DONE"       from "STARTED"    [2015-06-17 Wed 10:51]
- State "DONE"       from "TODO"       [2015-06-16 Tue 10:07]
- State "DONE"       from "STARTED"    [2015-06-15 Mon 10:29]
- State "DONE"       from "STARTED"    [2015-06-12 Fri 11:33]
- State "DONE"       from "TODO"       [2015-06-10 Wed 10:23]
- State "DONE"       from "TODO"       [2015-06-09 Tue 14:19]
- State "DONE"       from "STARTED"    [2015-06-08 Mon 11:16]
- State "DONE"       from "STARTED"    [2015-06-05 Fri 11:25]
- State "DONE"       from "TODO"       [2015-06-04 Thu 09:58]
- State "DONE"       from "TODO"       [2015-06-03 Wed 10:06]
- State "DONE"       from "STARTED"    [2015-06-02 Tue 10:10]
- State "DONE"       from "TODO"       [2015-06-01 Mon 13:54]
- State "DONE"       from "TODO"       [2015-05-28 Thu 11:40]
- State "DONE"       from "TODO"       [2015-05-27 Wed 13:36]
- State "DONE"       from "TODO"       [2015-05-26 Tue 17:30]
- State "DONE"       from "TODO"       [2015-05-08 Fri 15:19]
- State "DONE"       from "TODO"       [2015-05-07 Thu 18:31]
- State "DONE"       from "STARTED"    [2015-05-05 Tue 11:54]
- State "DONE"       from "TODO"       [2015-05-04 Mon 10:52]
- State "DONE"       from "STARTED"    [2015-05-04 Mon 10:52]
:LOGBOOK:  
CLOCK: [2015-06-17 Wed 09:57]--[2015-06-17 Wed 10:22] =>  0:25
CLOCK: [2015-06-15 Mon 09:50]--[2015-06-15 Mon 10:15] =>  0:25
CLOCK: [2015-06-11 Thu 17:38]--[2015-06-11 Thu 18:03] =>  0:25
CLOCK: [2015-06-08 Mon 10:43]--[2015-06-08 Mon 11:08] =>  0:25
CLOCK: [2015-06-05 Fri 09:25]--[2015-06-05 Fri 09:50] =>  0:25
CLOCK: [2015-06-02 Tue 09:39]--[2015-06-02 Tue 10:04] =>  0:25
CLOCK: [2015-05-05 Tue 11:14]--[2015-05-05 Tue 11:39] =>  0:25
CLOCK: [2015-05-04 Mon 10:32]--[2015-05-04 Mon 10:52] =>  0:20
CLOCK: [2015-05-04 Mon 09:48]--[2015-05-04 Mon 10:32] =>  0:44
:END:      
- State "DONE"       from "TODO"       [2015-04-29 Wed 23:32]
   - State "DONE"       from "TODO"       [2015-04-24 Fri 16:18]
   - State "DONE"       from "TODO"       [2015-04-23 Thu 13:47]
   - State "DONE"       from "STARTED"    [2015-04-22 Wed 11:35]
   - State "DONE"       from "STARTED"    [2015-04-21 Tue 14:05]
   - State "DONE"       from "STARTED"    [2015-04-17 Fri 11:09]
   - State "DONE"       from "STARTED"    [2015-04-15 Wed 16:08]
   - State "DONE"       from "TODO"       [2014-12-16 Tue 13:56]
   - State "DONE"       from "STARTED"    [2014-12-15 Mon 16:05]
   - State "DONE"       from "STARTED"    [2014-09-30 Tue 10:11]
   - State "DONE"       from "STARTED"    [2014-09-29 Mon 11:14]
   - State "DONE"       from "STARTED"    [2014-09-19 Fri 13:40]
   - State "DONE"       from "STARTED"    [2014-09-17 Wed 21:51]
   - State "DONE"       from "STARTED"    [2014-09-16 Tue 14:12]
   - State "DONE"       from "STARTED"    [2014-09-15 Mon 13:46]
   - State "DONE"       from "STARTED"    [2014-09-14 Sun 11:05]
   - State "DONE"       from "STARTED"    [2014-09-05 Fri 10:28]
   - State "DONE"       from "STARTED"    [2014-09-03 Wed 14:21]
   - State "DONE"       from "STARTED"    [2014-09-01 Mon 13:43]
   - State "DONE"       from "STARTED"    [2014-08-29 Fri 10:18]
   - State "DONE"       from "STARTED"    [2014-08-28 Thu 13:41]
   - State "DONE"       from "STARTED"    [2014-08-27 Wed 09:52]
   - State "DONE"       from "STARTED"    [2014-08-26 Tue 10:17]
   - State "DONE"       from "STARTED"    [2014-08-25 Mon 09:53]
   - State "DONE"       from "STARTED"    [2014-08-22 Fri 10:54]
   - State "DONE"       from "STARTED"    [2014-08-21 Thu 09:47]
   - State "DONE"       from "TODO"       [2014-08-20 Wed 09:48]
   - State "DONE"       from "STARTED"    [2014-08-19 Tue 09:34]
   - State "DONE"       from "STARTED"    [2014-08-18 Mon 13:58]
   - State "DONE"       from "TODO"       [2014-08-17 Sun 15:04]
   - State "DONE"       from "STARTED"    [2014-08-12 Tue 10:00]
   - State "DONE"       from "STARTED"    [2014-08-11 Mon 09:59]
   - State "DONE"       from "STARTED"    [2014-08-08 Fri 18:23]
   - State "DONE"       from "STARTED"    [2014-08-07 Thu 18:04]
   - State "DONE"       from "STARTED"    [2014-07-15 Tue 17:42]
   - State "DONE"       from "TODO"       [2014-06-17 Tue 15:21]
   - State "DONE"       from "STARTED"    [2014-06-06 Fri 10:08]
   - State "DONE"       from "TODO"       [2014-06-04 Wed 10:02]
   - State "DONE"       from "STARTED"    [2014-05-29 Thu 09:56]
   - State "DONE"       from "TODO"       [2014-03-28 Fri 11:14]
   :PROPERTIES:
:LAST_REPEAT: [2015-06-17 Wed 10:51]
   :END:
** STARTED Read RSS half an  hour                                     :LIFE:
DEADLINE: <2015-06-18 Thu 14:30 .+1d> SCHEDULED: <2015-06-18 Thu 13:40 .+1d>
- State "DONE"       from "STARTED"    [2015-06-17 Wed 14:07]
- State "DONE"       from "STARTED"    [2015-06-16 Tue 15:43]
- State "DONE"       from "STARTED"    [2015-06-15 Mon 13:49]
- State "DONE"       from "STARTED"    [2015-06-12 Fri 15:26]
- State "DONE"       from "STARTED"    [2015-06-11 Thu 17:02]
- State "DONE"       from "TODO"       [2015-06-10 Wed 14:34]
- State "DONE"       from "TODO"       [2015-06-09 Tue 14:19]
- State "DONE"       from "TODO"       [2015-06-09 Tue 14:19]
- State "DONE"       from "STARTED"    [2015-06-09 Tue 14:19]
- State "DONE"       from "TODO"       [2015-06-08 Mon 13:42]
- State "DONE"       from "TODO"       [2015-06-06 Sat 15:51]
- State "DONE"       from "TODO"       [2015-06-05 Fri 13:40]
- State "DONE"       from "TODO"       [2015-06-03 Wed 14:12]
- State "DONE"       from "TODO"       [2015-06-02 Tue 14:48]
- State "DONE"       from "TODO"       [2015-06-01 Mon 13:54]
- State "DONE"       from "TODO"       [2015-05-28 Thu 11:47]
- State "DONE"       from "TODO"       [2015-05-27 Wed 13:38]
- State "DONE"       from "TODO"       [2015-05-26 Tue 17:26]
- State "DONE"       from "TODO"       [2015-05-08 Fri 15:20]
- State "DONE"       from "TODO"       [2015-05-07 Thu 18:31]
- State "DONE"       from "TODO"       [2015-05-05 Tue 15:46]
- State "DONE"       from "STARTED"    [2015-05-04 Mon 18:16]
:LOGBOOK:  
CLOCK: [2015-06-18 Thu 15:21]--[2015-06-18 Thu 15:46] =>  0:25
CLOCK: [2015-06-17 Wed 13:35]--[2015-06-17 Wed 14:00] =>  0:25
CLOCK: [2015-06-16 Tue 14:59]--[2015-06-16 Tue 15:24] =>  0:25
CLOCK: [2015-06-15 Mon 13:37]--[2015-06-15 Mon 13:49] =>  0:12
CLOCK: [2015-06-12 Fri 13:44]--[2015-06-12 Fri 14:09] =>  0:25
CLOCK: [2015-06-11 Thu 16:15]--[2015-06-11 Thu 16:40] =>  0:25
CLOCK: [2015-06-09 Tue 13:37]--[2015-06-09 Tue 14:02] =>  0:25
CLOCK: [2015-05-04 Mon 14:29]--[2015-05-04 Mon 14:54] =>  0:25
:END:      
- State "DONE"       from "STARTED"    [2015-04-30 Thu 17:10]
   - State "DONE"       from "TODO"       [2015-04-24 Fri 16:18]
   - State "DONE"       from "STARTED"    [2015-04-23 Thu 13:47]
   - State "DONE"       from "STARTED"    [2015-04-21 Tue 15:41]
   - State "DONE"       from "TODO"       [2015-04-15 Wed 16:07]
   - State "DONE"       from "TODO"       [2015-04-15 Wed 16:06]
   - State "DONE"       from "TODO"       [2015-04-15 Wed 16:06]
   - State "DONE"       from "TODO"       [2015-04-15 Wed 16:06]
   - State "DONE"       from "TODO"       [2015-04-15 Wed 16:06]
   - State "DONE"       from "TODO"       [2015-04-15 Wed 16:06]
:PROPERTIES:
:LAST_REPEAT: [2015-06-17 Wed 14:07]
:END:
** TODO [#A]  Write English Diary，Conclude what I have learned today :LIFE:
   SCHEDULED: <2014-09-29 Mon 22:00-22:30 .+1d>
   - State "DONE"       from "TODO"       [2014-09-28 Sun 20:12]
   - State "DONE"       from "TODO"       [2014-08-25 Mon 23:42]
** STARTED [#B]  Read <<SCIP>> books                                    :DREAM:
SCHEDULED: <2015-06-04 Thu 07:30-08:30 .+1d>
- State "DONE"       from "STARTED"    [2015-06-03 Wed 16:39]
   :LOGBOOK:  






   CLOCK: [2015-06-03 Wed 14:31]--[2015-06-03 Wed 14:56] =>  0:25
   CLOCK: [2015-06-02 Tue 10:49]--[2015-06-02 Tue 11:14] =>  0:25
   :END:      
:PROPERTIES:
:LAST_REPEAT: [2015-06-03 Wed 16:39]
:END:
** TODO  Add PageView Vertical Scroll                                  :WORK:
   DEADLINE: <2015-03-27 Fri> SCHEDULED: <2015-03-23 Mon>

   [[file:~/org-notes/gtd.org::*Add%20CURL%20header%20file%20patch][Add CURL header file patch]]
** STARTED Fix node and scrollview nested issue                        :WORK:
   DEADLINE: <2015-04-23 Thu 18:00> SCHEDULED: <2015-04-23 Thu 14:00>
   :LOGBOOK:  
   CLOCK: [2015-04-23 Thu 13:47]--[2015-04-23 Thu 14:12] =>  0:25
   :END:      

** DONE Add discover-my-major, display difference color when line width larger than fill-column.
CLOSED: [2015-05-04 Mon 09:48] DEADLINE: <2015-05-06 Wed> SCHEDULED: <2015-05-01 Fri>
- State "DONE"       from "TODO"       [2015-05-04 Mon 09:48]

** DONE Write a PPT "Stop playing games, make them!"                  :WORK:
CLOSED: [2015-05-07 Thu 18:31] DEADLINE: <2015-05-05 Tue 18:00> SCHEDULED: <2015-05-05 Tue 14:00>
- State "DONE"       from "STARTED"    [2015-05-07 Thu 18:31]
:LOGBOOK:  
CLOCK: [2015-05-05 Tue 15:46]--[2015-05-25 Mon 09:58] => 474:12
CLOCK: [2015-05-05 Tue 13:37]--[2015-05-05 Tue 14:02] =>  0:25
:END:      

** DONE [#A]  upgrade rapidJson to latest version                     :WORK:
CLOSED: [2015-05-25 Mon 11:54] SCHEDULED: <2015-05-25 Mon 09:40>
- State "DONE"       from "STARTED"    [2015-05-25 Mon 11:54]
:LOGBOOK:  
CLOCK: [2015-05-25 Mon 09:58]--[2015-05-25 Mon 10:00] =>  0:02
:END:      

** DONE [#A] Add JSB projects to jenkins-ci                           :WORK:
CLOSED: [2015-05-26 Tue 17:26] SCHEDULED: <2015-05-25 Mon 11:30>
- State "DONE"       from "TODO"       [2015-05-26 Tue 17:26]

** DONE Add more data format for Android 9-patch image                :WORK:
CLOSED: [2015-06-09 Tue 15:47] SCHEDULED: <2015-05-25 Mon 15:00>
- State "DONE"       from "TODO"       [2015-06-09 Tue 15:47]

** DONE Write <<Matering Emacs>> after reading words.                 :LIFE:
CLOSED: [2015-05-26 Tue 17:26] SCHEDULED: <2015-05-25 Mon 20:00>
- State "DONE"       from "TODO"       [2015-05-26 Tue 17:26]


** DONE Integrate Qiniu upload image in dired buffer. Support marked files. :LIFE:
CLOSED: [2015-06-07 Sun 19:45] SCHEDULED: <2015-05-30 Sat>
- State "DONE"       from "TODO"       [2015-06-07 Sun 19:45]


** CANCELLED Add functions to translate links in Markdown buffer, use c-u to allow custom text input :LIFE:
CLOSED: [2015-06-10 Wed 10:33] SCHEDULED: <2015-05-30 Sat>
- State "CANCELLED"  from "TODO"       [2015-06-10 Wed 10:33] \\
  这个需求不是很重要，可以使用org-mac-link来代替

** CANCELLED Migrate my blog to China, gitcaf                         :LIFE:
CLOSED: [2015-06-09 Tue 11:48] SCHEDULED: <2015-05-25 Mon>
- State "CANCELLED"  from "STARTED"    [2015-06-09 Tue 11:48] \\
  gitcafe is crappy
:LOGBOOK:  
CLOCK: [2015-06-08 Mon 22:44]--[2015-06-09 Tue 13:37] => 14:53
:END:      

** DONE Try out Emacs package Deft                                    :LIFE:
CLOSED: [2015-06-02 Tue 09:38] SCHEDULED: <2015-05-29 Fri>
- State "DONE"       from "STARTED"    [2015-06-02 Tue 09:38]
:LOGBOOK:  
CLOCK: [2015-06-01 Mon 23:04]--[2015-06-02 Tue 09:39] => 10:35
:END:      
- State "TODO"       from "CANCELLED"  [2015-06-01 Mon 23:04]
http://pragmaticemacs.com/emacs/make-quick-notes-with-deft/

** CANCELLED Add Github Pull request workflow in Emacs. Found out what's the best. :WORK:
CLOSED: [2015-06-02 Tue 09:38] SCHEDULED: <2015-05-27 Wed>
- State "CANCELLED"  from "TODO"       [2015-06-02 Tue 09:38] \\
  Currently the Cocos2D-X repository has too many pull request
Now there are two options:
- use magit-gh-pull mode. Maybe a optional magit-gh-pull mode
- modify local .git/config, when a repository contains tons of pr, this way is not good

** CANCELLED Add coverage tool to cocos2d-x project.                  :WORK:
CLOSED: [2015-06-11 Thu 09:57] SCHEDULED: <2015-06-06 Sat>
- State "CANCELLED"  from "TODO"       [2015-06-11 Thu 09:57] \\
  这个任务暂时取消

** DONE Study Doxygen document international.                         :WORK:
CLOSED: [2015-05-27 Wed 16:12] DEADLINE: <2015-05-27 Wed 18:00> SCHEDULED: <2015-05-27 Wed 14:00>
- State "DONE"       from "STARTED"    [2015-05-27 Wed 16:12]
:LOGBOOK:  
CLOCK: [2015-05-27 Wed 13:38]--[2015-05-27 Wed 14:03] =>  0:25
:END:      

** DONE Add Chinese Translation to Cocos2D-X header files.            :WORK:
CLOSED: [2015-06-11 Thu 16:15] SCHEDULED: <2015-06-03 Wed 10:10>
- State "DONE"       from "STARTED"    [2015-06-11 Thu 16:15]
:LOGBOOK:  
CLOCK: [2015-06-11 Thu 14:43]--[2015-06-11 Thu 15:08] =>  0:25
CLOCK: [2015-06-11 Thu 10:29]--[2015-06-11 Thu 10:54] =>  0:25
CLOCK: [2015-06-11 Thu 09:59]--[2015-06-11 Thu 10:24] =>  0:25
CLOCK: [2015-06-10 Wed 16:24]--[2015-06-10 Wed 16:49] =>  0:25
CLOCK: [2015-06-10 Wed 16:03]--[2015-06-10 Wed 16:24] =>  0:21
CLOCK: [2015-06-09 Tue 16:34]--[2015-06-09 Tue 16:59] =>  0:25
CLOCK: [2015-06-08 Mon 16:30]--[2015-06-08 Mon 16:55] =>  0:25
CLOCK: [2015-06-08 Mon 15:42]--[2015-06-08 Mon 16:07] =>  0:25
CLOCK: [2015-06-08 Mon 14:26]--[2015-06-08 Mon 14:51] =>  0:25
CLOCK: [2015-06-08 Mon 12:03]--[2015-06-08 Mon 12:28] =>  0:25
CLOCK: [2015-06-08 Mon 11:16]--[2015-06-08 Mon 11:41] =>  0:25
CLOCK: [2015-06-06 Sat 16:32]--[2015-06-06 Sat 16:57] =>  0:25
CLOCK: [2015-06-06 Sat 15:52]--[2015-06-06 Sat 16:17] =>  0:25
CLOCK: [2015-06-03 Wed 10:07]--[2015-06-03 Wed 10:32] =>  0:25
CLOCK: [2015-06-02 Tue 16:41]--[2015-06-03 Wed 09:19] => 16:38
CLOCK: [2015-06-02 Tue 16:03]--[2015-06-02 Tue 16:28] =>  0:25
CLOCK: [2015-06-02 Tue 15:30]--[2015-06-02 Tue 15:55] =>  0:25
CLOCK: [2015-06-02 Tue 15:00]--[2015-06-02 Tue 15:25] =>  0:25
CLOCK: [2015-06-01 Mon 13:55]--[2015-06-01 Mon 14:20] =>  0:25
CLOCK: [2015-06-01 Mon 09:24]--[2015-06-01 Mon 09:49] =>  0:25
:END:      

** CANCELLED Add Python compile and debug support for Emacs          :DREAM:
CLOSED: [2015-06-09 Tue 14:19] DEADLINE: <2015-06-14 Sun> SCHEDULED: <2015-06-07 Sun>
- State "CANCELLED"  from "TODO"       [2015-06-09 Tue 14:19] \\
  Don't need this feature

** DONE Improve automatically translation tools                       :WORK:
CLOSED: [2015-06-01 Mon 09:23] DEADLINE: <2015-06-01 Mon> SCHEDULED: <2015-06-01 Mon 09:16>
- State "DONE"       from "STARTED"    [2015-06-01 Mon 09:23]

** TODO  打造自己的sublime Text3 编辑器                                :WORK:
SCHEDULED: <2015-06-07 Sun>
http://lucida.me/blog/sublime-text-complete-guide/

** DONE 汉化自己的中文博客，对照下面的链接，给出自己的简历。
CLOSED: [2015-06-11 Thu 17:35] SCHEDULED: <2015-06-11 Thu>
- State "DONE"       from "TODO"       [2015-06-11 Thu 17:35]
http://lucida.me/blog/levels-on-learning-and-using-technologies/

** DONE 更新cocos2d-x opengles系列教程，完善webgl系列教程             :LIFE:
CLOSED: [2015-06-17 Wed 19:37] SCHEDULED: <2015-06-16 Tue 16:00>
- State "DONE"       from "STARTED"    [2015-06-17 Wed 19:37]
:LOGBOOK:  
CLOCK: [2015-06-16 Tue 16:59]--[2015-06-16 Tue 17:24] =>  0:25
CLOCK: [2015-06-16 Tue 16:06]--[2015-06-16 Tue 16:31] =>  0:25
:END:      

** DONE 阅读spacemacs的Release note.                                  :LIFE:
CLOSED: [2015-06-01 Mon 23:02] SCHEDULED: <2015-06-01 Mon 22:00>
- State "DONE"       from "STARTED"    [2015-06-01 Mon 23:02]
:LOGBOOK:  
CLOCK: [2015-06-01 Mon 21:21]--[2015-06-01 Mon 23:04] =>  1:43
:END:      
https://github.com/syl20bnr/spacemacs/releases#0-102-x-sec-2

** DONE 修复引擎C++模板在Windows下面资源有改动不拷贝的问题            :WORK:
CLOSED: [2015-06-01 Mon 21:21] DEADLINE: <2015-06-01 Mon 18:00> SCHEDULED: <2015-06-01 Mon 14:32>
- State "DONE"       from "STARTED"    [2015-06-01 Mon 21:21]
:LOGBOOK:  
CLOCK: [2015-06-01 Mon 17:56]--[2015-06-01 Mon 21:21] =>  3:25
CLOCK: [2015-06-01 Mon 15:08]--[2015-06-01 Mon 17:56] =>  2:48
CLOCK: [2015-06-01 Mon 14:32]--[2015-06-01 Mon 14:57] =>  0:25
:END:      

** DONE 处理Cocos2D-X Pull Request                                    :WORK:
CLOSED: [2015-06-02 Tue 10:49] SCHEDULED: <2015-06-02 Tue 10:12>
- State "DONE"       from "STARTED"    [2015-06-02 Tue 10:49]
:LOGBOOK:  
CLOCK: [2015-06-02 Tue 10:10]--[2015-06-02 Tue 10:35] =>  0:25
:END:      

** DONE 处理PR                                                        :WORK:
CLOSED: [2015-06-03 Wed 09:54] SCHEDULED: <2015-06-03 Wed 09:20>
- State "DONE"       from "STARTED"    [2015-06-03 Wed 09:54]
:LOGBOOK:  
CLOCK: [2015-06-03 Wed 09:19]--[2015-06-03 Wed 09:44] =>  0:25
:END:      

** DONE Fix UI consumes extra memory issue                         :WRITING:
CLOSED: [2015-06-06 Sat 15:51] SCHEDULED: <2015-06-04 Thu 10:00>
- State "DONE"       from "STARTED"    [2015-06-06 Sat 15:51]
- State "TODO"       from "DONE"       [2015-06-04 Thu 09:59]
- State "DONE"       from "STARTED"    [2015-06-04 Thu 09:58]
:LOGBOOK:  
CLOCK: [2015-06-05 Fri 13:40]--[2015-06-05 Fri 14:05] =>  0:25
CLOCK: [2015-06-04 Thu 09:59]--[2015-06-04 Thu 11:05] =>  1:06
CLOCK: [2015-06-03 Wed 16:52]--[2015-06-03 Wed 17:17] =>  0:25
:END:      

** DONE 处理PR                                                        :WORK:
CLOSED: [2015-06-04 Thu 09:58] DEADLINE: <2015-06-04 Thu 12:00> SCHEDULED: <2015-06-04 Thu 09:30>
- State "DONE"       from "STARTED"    [2015-06-04 Thu 09:58]
:LOGBOOK:  
CLOCK: [2015-06-04 Thu 09:25]--[2015-06-04 Thu 09:50] =>  0:25
:END:      

** TODO  使用org-mode建立自己的wiki系统，同时把这个wiki系统弄到阿里云上面去。 :LIFE:
http://orgmode.org/worg/org-blog-wiki.html
https://github.com/shishougang/wiki/blob/gh-pages/src/notes-init.el
http://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html
http://blog.csdn.net/meteor1113/article/details/4395673
SCHEDULED: <2015-06-06 Sat>

** DONE 写一篇中文博客                                                :LIFE:
CLOSED: [2015-06-11 Thu 09:59] DEADLINE: <2015-06-08 Mon 00:00> SCHEDULED: <2015-06-07 Sun 23:00>
- State "DONE"       from "TODO"       [2015-06-11 Thu 09:59]

** DONE 分享我的spacemacs的使用                                       :LIFE:
CLOSED: [2015-06-08 Mon 00:25] DEADLINE: <2015-06-07 Sun 23:30> SCHEDULED: <2015-06-07 Sun 22:50>
- State "DONE"       from "STARTED"    [2015-06-08 Mon 00:25]
:LOGBOOK:  
CLOCK: [2015-06-07 Sun 22:50]--[2015-06-07 Sun 23:15] =>  0:25
:END:      

** DONE 设置Emacs的中文等宽字体                                       :LIFE:
CLOSED: [2015-06-14 Sun 10:29] SCHEDULED: <2015-06-13 Sat>
- State "DONE"       from "TODO"       [2015-06-14 Sun 10:29]

** DONE 我要去下载新的Emacs版本                                       :LIFE:
CLOSED: [2015-06-17 Wed 09:25]
- State "DONE"       from "TODO"       [2015-06-17 Wed 09:25]
[[http://emacsformacosx.com/][GNU Emacs For Mac OS X]]

** DONE Learn spacemacs layer                                         :LIFE:
CLOSED: [2015-06-16 Tue 14:59] SCHEDULED: <2015-06-16 Tue 09:40>
- State "DONE"       from "STARTED"    [2015-06-16 Tue 14:59]
- State "DONE"       from "TODO"       [2015-06-15 Mon 10:29]
- State "DONE"       from "STARTED"    [2015-06-12 Fri 13:44]
- State "DONE"       from "STARTED"    [2015-06-08 Mon 10:43]
:LOGBOOK:  
CLOCK: [2015-06-16 Tue 11:03]--[2015-06-16 Tue 11:28] =>  0:25
CLOCK: [2015-06-12 Fri 11:33]--[2015-06-12 Fri 13:44] =>  2:11
CLOCK: [2015-06-12 Fri 10:52]--[2015-06-12 Fri 11:17] =>  0:25
CLOCK: [2015-06-08 Mon 09:40]--[2015-06-08 Mon 10:05] =>  0:25
:END:      
:PROPERTIES:
:LAST_REPEAT: [2015-06-15 Mon 10:29]
:END:

** DONE 检查中文翻译的PR                                              :WORK:
CLOSED: [2015-06-09 Tue 15:46] SCHEDULED: <2015-06-09 Tue 14:22>
- State "DONE"       from "STARTED"    [2015-06-09 Tue 15:46]
:LOGBOOK:  
CLOCK: [2015-06-09 Tue 14:50]--[2015-06-09 Tue 15:15] =>  0:25
CLOCK: [2015-06-09 Tue 14:20]--[2015-06-09 Tue 14:45] =>  0:25
:END:      

** DONE 学习cVim的Chrome插件，同时设置自己的快捷键                 :ENGLISH:
CLOSED: [2015-06-14 Sun 10:28] SCHEDULED: <2015-06-13 Sat>
- State "DONE"       from "CANCELLED"  [2015-06-14 Sun 10:29]

** DONE Review一些Cocos2D-X的PR，同时修改changelog                    :WORK:
CLOSED: [2015-06-10 Wed 11:04] SCHEDULED: <2015-06-10 Wed 10:40>
- State "DONE"       from "STARTED"    [2015-06-10 Wed 11:04]
:LOGBOOK:  
CLOCK: [2015-06-10 Wed 10:36]--[2015-06-10 Wed 11:01] =>  0:25
:END:      

** TODO  使用Clojure搭建一个Emacs社区                                 :LIFE:
SCHEDULED: <2015-07-20 Mon>

** DONE 把spacemacs的配置整理一下，变成一个zilongshanren Layer，同时简单一些不要的配置。 :LIFE:
CLOSED: [2015-06-14 Sun 22:58] SCHEDULED: <2015-06-14 Sun>
- State "DONE"       from "TODO"       [2015-06-14 Sun 22:58]

** DONE 给ui::Slider添加按下和释放事件类型。同时，与文海商量，以前的百分比接口怎么修改，要注意兼容性。 :WORK:
CLOSED: [2015-06-16 Tue 10:08] SCHEDULED: <2015-06-15 Mon 10:30>
- State "DONE"       from "STARTED"    [2015-06-16 Tue 10:08]
:LOGBOOK:  
CLOCK: [2015-06-15 Mon 13:58]--[2015-06-15 Mon 14:23] =>  0:25
CLOCK: [2015-06-15 Mon 10:30]--[2015-06-15 Mon 10:55] =>  0:25
CLOCK: [2015-06-12 Fri 16:20]--[2015-06-15 Mon 09:50] => 65:30
:END:      

** TODO   观看WWDC 的视频，重点关注一下游戏的部分。                   :WORK:
SCHEDULED: <2015-06-11 Thu 22:00>

** DONE 编写emacser.com的“手术”方案                                   :LIFE:
CLOSED: [2015-06-14 Sun 22:58] SCHEDULED: <2015-06-13 Sat>
- State "DONE"       from "TODO"       [2015-06-14 Sun 22:58]

** TODO 为InfoQ编写WWDC的文章，可以结合视频和Keynote来弄             :DREAM:
SCHEDULED: <2015-06-13 Sat>

** DONE 处理PR                                                        :WORK:
CLOSED: [2015-06-12 Fri 10:21] SCHEDULED: <2015-06-12 Fri 09:50>
- State "DONE"       from "STARTED"    [2015-06-12 Fri 10:21]
:LOGBOOK:  
CLOCK: [2015-06-12 Fri 09:49]--[2015-06-12 Fri 10:14] =>  0:25
:END:      

** DONE 处理邮件                                                      :WORK:
CLOSED: [2015-06-12 Fri 10:50] SCHEDULED: <2015-06-12 Fri 10:21>
- State "DONE"       from "STARTED"    [2015-06-12 Fri 10:50]
:LOGBOOK:  
CLOCK: [2015-06-12 Fri 10:21]--[2015-06-12 Fri 10:46] =>  0:25
:END:      

** DONE Read Spacemacs docs                                          :Emacs:
CLOSED: [2015-06-12 Fri 16:20] SCHEDULED: <2015-06-12 Fri 15:27>
- State "DONE"       from "STARTED"    [2015-06-12 Fri 16:20]
:LOGBOOK:  
CLOCK: [2015-06-12 Fri 15:26]--[2015-06-12 Fri 16:20] =>  0:54
:END:      

** TODO  学习Org-Mode管理小项目的方法                                :Emacs:
SCHEDULED: <2015-06-20 Sat>

** DONE 处理Cocos2D-X的PR                                             :WORK:
CLOSED: [2015-06-16 Tue 10:42] SCHEDULED: <2015-06-16 Tue 10:10>
- State "DONE"       from "STARTED"    [2015-06-16 Tue 10:42]
:LOGBOOK:  
CLOCK: [2015-06-16 Tue 10:08]--[2015-06-16 Tue 10:33] =>  0:25
:END:      

** DONE 处理PR和邮件                                                  :WORK:
CLOSED: [2015-06-17 Wed 09:57] SCHEDULED: <2015-06-17 Wed 09:27>
- State "DONE"       from "STARTED"    [2015-06-17 Wed 09:57]
:LOGBOOK:  
CLOCK: [2015-06-17 Wed 09:26]--[2015-06-17 Wed 09:51] =>  0:25
:END:      

** TODO  fork eim并且把它提取出一个包，取名ChineseWubi               :Emacs:
SCHEDULED: <2015-06-20 Sat>

** DONE 修复spritePolygon在Linux编译不过的问题。                      :WORK:
CLOSED: [2015-06-17 Wed 13:34] SCHEDULED: <2015-06-17 Wed 10:53>
- State "DONE"       from "STARTED"    [2015-06-17 Wed 13:34]
:LOGBOOK:  
CLOCK: [2015-06-17 Wed 10:52]--[2015-06-17 Wed 11:17] =>  0:25
:END:      

** DONE 处理PR和修复引擎的一些 bug                                    :WORK:
CLOSED: [2015-06-17 Wed 14:53] SCHEDULED: <2015-06-17 Wed 14:10>
- State "DONE"       from "TODO"       [2015-06-17 Wed 14:53]

** DONE 下载三星的cpcEx文档                                           :WORK:
CLOSED: [2015-06-17 Wed 15:59] SCHEDULED: <2015-06-17 Wed 15:00>
- State "DONE"       from "STARTED"    [2015-06-17 Wed 15:59]
:LOGBOOK:  
CLOCK: [2015-06-17 Wed 14:53]--[2015-06-17 Wed 15:18] =>  0:25
:END:      

** DONE 翻译cocos API,同时修改配置文件                                :WORK:
CLOSED: [2015-06-17 Wed 19:37] SCHEDULED: <2015-06-17 Wed 16:00>
- State "DONE"       from "STARTED"    [2015-06-17 Wed 19:37]
:LOGBOOK:  
CLOCK: [2015-06-17 Wed 15:59]--[2015-06-17 Wed 16:24] =>  0:25
:END:      

** DONE 处理邮件                                                      :WORK:
CLOSED: [2015-06-18 Thu 15:21] SCHEDULED: <2015-06-18 Thu 15:00>
- State "DONE"       from "TODO"       [2015-06-18 Thu 15:21]

* Weekly Tasks
** TODO [#A] Write a Blog, no matter English or Chinese               :LIFE:
SCHEDULED: <2015-06-02 Tue .+7d/8d>
- State "DONE"       from "TODO"       [2015-05-26 Tue 17:26]
   - State "DONE"       from "TODO"       [2015-03-12 Thu 18:05]
   - State "DONE"       from "TODO"       [2015-01-19 Mon 09:35]
   - State "DONE"       from "TODO"       [2014-09-30 Tue 08:23]
   - State "DONE"       from "TODO"       [2014-09-15 Mon 09:22]
   - State "DONE"       from "TODO"       [2014-09-08 Mon 23:28]
   - State "DONE"       from "TODO"       [2014-09-01 Mon 10:26]
   - State "DONE"       from "TODO"       [2014-08-25 Mon 09:18]
   - State "DONE"       from "TODO"       [2014-08-13 Wed 09:50]
  - State "DONE"       from "TODO"       [2014-08-02 Sat 07:00]
  :LOGBOOK:
  CLOCK: [2014-03-30 Sun 22:45]--[2014-03-30 Sun 22:57] =>  0:12
  :END:
:PROPERTIES:
:LAST_REPEAT: [2015-05-26 Tue 17:26]
:END:
** TODO Call my mum                                                   :LIFE:
SCHEDULED: <2015-06-23 Tue 10:00-10:30 .+7d/8d>
- State "DONE"       from "TODO"       [2015-06-16 Tue 08:54]
- State "DONE"       from "TODO"       [2015-06-09 Tue 11:48]
- State "DONE"       from "TODO"       [2015-06-01 Mon 23:02]
- State "DONE"       from "TODO"       [2015-05-25 Mon 09:36]
- State "DONE"       from "TODO"       [2015-05-08 Fri 15:19]
- State "DONE"       from "TODO"       [2015-05-01 Fri 12:42]
   - State "DONE"       from "TODO"       [2014-04-07 Mon 20:00]
   - State "DONE"       from "STARTED"    [2014-03-29 Sat 10:11]
:PROPERTIES:
:LAST_REPEAT: [2015-06-16 Tue 08:54]
:END:

# The following section is used for Monthly Tasks
* Monthly Tasks
  #+category: Monthly
** TODO [#A] Write a article to summary the fruit of a month          :LIFE:
SCHEDULED: <2015-06-07 Sun 20:20 .+30d/31d>
- State "DONE"       from "TODO"       [2015-05-08 Fri 15:20]
   - State "DONE"       from "TODO"       [2015-01-19 Mon 09:35]
   - State "DONE"       from "TODO"       [2014-12-16 Tue 14:24]
   - State "DONE"       from "STARTED"    [2014-09-30 Tue 09:39]
   - State "DONE"       from "TODO"       [2014-08-27 Wed 09:53]
   - State "DONE"       from "TODO"       [2014-07-15 Tue 17:42]
   - State "DONE"       from "STARTED"    [2014-05-14 Wed 10:43]
   - State "DONE"       from "STARTED"    [2014-03-30 Sun 22:43]
   :LOGBOOK:
   CLOCK: [2014-09-30 Tue 08:23]--[2014-09-30 Tue 08:49] =>  0:26
   CLOCK: [2014-05-14 Wed 10:13]--[2014-05-14 Wed 10:38] =>  0:25
   CLOCK: [2014-03-30 Sun 22:37]--[2014-03-30 Sun 22:43] =>  0:06
   CLOCK: [2014-03-30 Sun 22:14]--[2014-03-30 Sun 22:26] =>  0:12
   :END:
:PROPERTIES:
:LAST_REPEAT: [2015-05-08 Fri 15:20]
:END:

** TODO Sync the Spacemacs Emacs configuration from upstream
SCHEDULED: <2015-06-24 Wed 20:20 .+30d/31d>
- State "DONE"       from "TODO"       [2015-05-25 Mon 09:36]
   - State "DONE"       from "TODO"       [2015-04-13 Mon 09:26]
   :PROPERTIES:
   :LAST_REPEAT: [2015-05-25 Mon 09:36]
   :END:

#+category: Review

# The following section is used for Daily Review
* Daily Review
#+BEGIN: clocktable :maxlevel 5 :scope agenda-with-archives :block today :fileskip0 t :indent t
#+CAPTION: Clock summary at [2015-06-08 Mon 16:55], for Monday, June 08, 2015.
| File    | Headline                                      | Time   |      |
|---------+-----------------------------------------------+--------+------|
|         | ALL *Total time*                              | *2:55* |      |
|---------+-----------------------------------------------+--------+------|
| gtd.org | *File time*                                   | *2:55* |      |
|         | Daily Tasks                                   | 2:55   |      |
|         | \emsp TODO [#B] Visit Cocos2D-x.org, visit... |        | 0:25 |
|         | \emsp STARTED Add Chinese Translation to...   |        | 2:05 |
|         | \emsp TODO Learn spacemacs layer              |        | 0:25 |
#+END:

#+BEGIN_SRC emacs-lisp :results value
(setq week-range (org-clock-special-range 'today nil t))
(org-clock-sum-today-by-tags nil (nth 0 week-range) (nth 1 week-range) t)
#+END_SRC

#+RESULTS:
: [-Nothing-] Done nothing!!!

# The following section is used for Weekly Review
* Weekly Review
#+BEGIN: clocktable :maxlevel 5 :scope agenda-with-archives :block thisweek :fileskip0 t :indent t
#+CAPTION: Clock summary at [2015-06-16 Tue 14:37], for week 2015-W25.
| File    | Headline                                      | Time    |       |
|---------+-----------------------------------------------+---------+-------|
|         | ALL *Total time*                              | *12:07* |       |
|---------+-----------------------------------------------+---------+-------|
| gtd.org | *File time*                                   | *12:07* |       |
|         | Daily Tasks                                   | 12:07   |       |
|         | \emsp TODO [#B] Visit Cocos2D-x.org, visit... |         |  0:25 |
|         | \emsp TODO Read RSS half an  hour             |         |  0:12 |
|         | \emsp STARTED Learn spacemacs layer           |         |  0:25 |
|         | \emsp DONE...                                 |         | 10:40 |
|         | \emsp DONE 处理Cocos2D-X的PR                  |         |  0:25 |
#+END:

#+BEGIN_SRC emacs-lisp :results value
  (setq week-range (org-clock-special-range 'thisweek nil t))
  (org-clock-sum-today-by-tags nil (nth 0 week-range) (nth 1 week-range) t)
#+END_SRC

#+RESULTS:
: [-Nothing-] Done nothing!!!


# The following section is used for Monthly Review
* Monthly Review
#+BEGIN: clocktable :maxlevel 5 :scope agenda-with-archives :block thismonth :fileskip0 t :indent t
#+CAPTION: Clock summary at [2015-06-08 Mon 00:18], for June 2015.
| File    | Headline                                                      | Time       |       |
|---------+---------------------------------------------------------------+------------+-------|
|         | ALL *Total time*                                              | *1d 20:10* |       |
|---------+---------------------------------------------------------------+------------+-------|
| gtd.org | *File time*                                                   | *1d 20:10* |       |
|         | Daily Tasks                                                   | 1d 20:10   |       |
|         | \emsp TODO [#B] Visit Cocos2D-x.org, visit...                 |            |  0:50 |
|         | \emsp STARTED [#B]  Read <<The little...                      |            |  0:50 |
|         | \emsp DONE Try out Emacs package Deft                         |            | 10:35 |
|         | \emsp STARTED Add Chinese Translation to...                   |            | 19:58 |
|         | \emsp DONE 阅读spacemacs的Release note.                       |            |  1:43 |
|         | \emsp DONE 修复引擎C++模板在Windows下面资源有改动不拷贝的问题 |            |  6:38 |
|         | \emsp DONE 处理Cocos2D-X Pull Request                         |            |  0:25 |
|         | \emsp DONE 处理PR                                             |            |  0:25 |
|         | \emsp DONE Fix UI consumes extra memory issue                 |            |  1:56 |
|         | \emsp DONE 处理PR                                             |            |  0:25 |
|         | \emsp STARTED 分享我的spacemacs的使用                         |            |  0:25 |
#+END:

#+BEGIN_SRC emacs-lisp :results value
(setq week-range (org-clock-special-range 'thismonth nil t))
(org-clock-sum-today-by-tags nil (nth 0 week-range) (nth 1 week-range) t)
#+END_SRC

#+RESULTS:
: [-WORK-] 28:41
: [-DREAM-] 00:50
: [-WRITING-] 01:56
: [-LIFE-] 12:43

